code-examples/prodaja-samoposluzni-s-elektronickim-potpisom-915-zahtjev.xml

<?xml version="1.0"  encoding="UTF-8"?>  
<soapenv:Envelope  xmlns:xd ="http://www.w3.org/2000/09/xmldsig# " 
xmlns:tns ="http://www.apis-it.hr/fin/2012/types/f73 " 
xmlns:soapenv ="http://schemas.xmlsoap.org/soap/envelope/ "> 
<soapenv:Header /> 
<soapenv:Body> 
<tns:RacunZahtjev  Id="racunId "> 
<tns:Zaglavlje> 
<tns:IdPoruke>3141f631-da0a-43ae-bf0b-810d62e414b3 </tns:IdPoruke> 
<tns:DatumVrijeme>24.01.2020T09:51:11 </tns:DatumVrijeme> 
</tns:Zaglavlje> 
<tns:Racun> 
<tns:Oib>98765432198 </tns:Oib> 
<tns:USustPdv>true</tns:USustPdv> 
<tns:DatVrijeme>24.01.2020T09:50:22 </tns:DatVrijeme> 
<tns:OznSlijed>P</tns:OznSlijed> 
<tns:BrRac> 
< tns:BrOznRac>5</tns:BrOznRac> 
< tns:OznPosPr>POS3</tns:OznPosPr> 
< tns:OznNapUr>123456789 </tns:OznNapUr> 
</ tns:BrRac> 
<tns:Pdv> 
<tns:Porez> 
< tns:Stopa>25.00</tns:Stopa> 
< tns:Osnovica>29.00</tns:Osnovica> 
< tns:Iznos>7.25</tns:Iznos> 
</ tns:Porez> 
</tns:Pdv> 
<tns:IznosUkupno>36.25</tns:IznosUkupno> 
<tns:NacinPlac>G</tns:NacinPlac> 
<tns:OibOper>01234567890 </tns:OibOper> 
<tns:ZastKod>c41f538d7fcbc16e7d1bee51740b5417 </tns:ZastKod> 
<tns:NakDost>false</tns:NakDost> 
</tns:Racun> 
</tns:RacunZahtjev> 
</soapenv:Body> 
</soapenv:Envelope>